# Завдання 1: Обчислення значень виразів
print("7 + 3 * 2 =", 7 + 3 * 2)
print("(10 - 3) ** 2 =", (10 - 3) ** 2)
print("20 // 3 =", 20 // 3, "20 % 3 =", 20 % 3)
print("-" * 30)

# Завдання 2: Результати порівняння чисел
print("5 > 2:", 5 > 2)
print("7 == 8:", 7 == 8)
print("4 != 4:", 4 != 4)
print("6 <= 6:", 6 <= 6)
print("-" * 30)

# Завдання 3: Перевірка парності числа
while True:
    try:
        num = int(input("Введіть ціле число для перевірки на парність: "))
        break  # Виходимо з циклу, якщо введено коректне ціле число
    except ValueError:
        print("Помилка! Ви ввели не ціле число. Будь ласка, спробуйте ще раз.")

if num % 2 == 0:
    print(f"Число {num} є парним.")
else:
    print(f"Число {num} є непарним.")
print("-" * 30)

# Завдання 5: Обчислення суми квадратів двох чисел з використанням **=
num1 = 3
num2 = 4

sq1 = num1
sq2 = num2

sq1 **= 2
sq2 **= 2

sum_of_squares = sq1 + sq2
print(f"Сума квадратів {num1}^2 + {num2}^2 = {sum_of_squares}")
print("-" * 30)

# Завдання 6: Побітові оператори для чисел 5 і 3
print("5 & 3 =", 5 & 3)
print("5 | 3 =", 5 | 3)
print("5 ^ 3 =", 5 ^ 3)
print("~5 =", ~5)