# Завдання 1: Надрукуйте повідомлення «Моя перша програма на Python»
print("Моя перша програма на Python")

# Завдання 2: Виведіть своє прізвище та ім’я в одному рядку
print("Леськів Дмитро")

# Завдання 3: Напишіть програму, яка виводить значення виразу 7 * 8
print(7 * 8)

# Завдання 4: Створіть змінну name, запишіть у неї своє ім’я та виведіть рядок
name = "Дмитро"
print("Привіт, моє ім’я", name + ".")

# Завдання 5: Виведіть три довільні слова в один рядок через кому та через тире
print("Один", "два", "три", sep=", ")
print("Один", "два", "три", sep="-")

# Завдання 6: Складіть програму, яка друкує таблицю чисел
print("1 2 3\n4 5 6\n7 8 9")