# Завдання 1: Перевірка рівності двох чисел
num1 = float(input("Введіть перше число: "))
num2 = float(input("Введіть друге число: "))
if num1 == num2:
    print("Числа рівні")
else:
    print("Числа не рівні")
print("-" * 30)

# Завдання 2: Перевірка, чи число більше нуля
num_check = float(input("Введіть число: "))
if num_check > 0:
    print("Число більше нуля")
else:
    print("Число менше або дорівнює нулю")
print("-" * 30)

# Завдання 3: Порівняння двох рядків
str1 = input("Введіть перший рядок: ")
str2 = input("Введіть другий рядок: ")
if str1 == str2:
    print("Рядки однакові")
else:
    print("Рядки різні")
print("-" * 30)

# Завдання 4: Перевірка входження числа в діапазон від 1 до 100 включно
range_num = float(input("Введіть число для перевірки діапазону (1-100): "))
if 1 <= range_num <= 100:
    print("Число входить у діапазон від 1 до 100 включно")
else:
    print("Число не входить у діапазон")
print("-" * 30)

# Завдання 5: Перевірка логіна користувача
login = "admin"
user_login = input("Введіть логін: ")
if user_login == login:
    print("Доступ дозволено")
else:
    print("Доступ заборонено")
print("-" * 30)

# Завдання 6: Перевірка трьох чисел на порядок зростання
a = float(input("Введіть перше число: "))
b = float(input("Введіть друге число: "))
c = float(input("Введіть третє число: "))

if a < b < c:
    print("Числа розташовані у порядку зростання")
else:
    print("Числа не розташовані у порядку зростання")